OpenFOAM-dev/tutorials/multiRegion/film/VoFToFilm/0/film/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    wall
    {
        type            noSlip;
    }

    surface
    {
        type            filmSurfaceVelocity;
        value           $internalField;
    }

    bottom
    {
        type            zeroGradient;
    }

    atmosphere
    {
        type            fixedValue;
        value           $internalField;
    }
}


// ************************************************************************* //
