OpenFOAM-dev/tutorials/multiRegion/film/VoFToFilm/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication -s VoF blockMesh -region VoF

runApplication extrudeToRegionMesh -region VoF -overwrite

runApplication setFields -region VoF

printf "\n%s\n" "Creating files for paraview post-processing"
paraFoam -touchAll
echo

runApplication $(getApplication)

#------------------------------------------------------------------------------
